/* =======================================================

    Алгоритми і структура данних
    Лабораторна робота №9-10
    Виконав: Чорноус Сергій ІПЗ-22

 ======================================================= */

#include <iostream>
#include <windows.h>
#include "mainSearch.h"
#include "search.h"
#include "../MyLib.h"
#include "test.h"

using namespace std;

// ====== MAIN ======
int SearchMenu()
{
    bool run = true;
    short choice;

    while (run)
    {
        cout << FromCustomFormatToString(R"(<magenta><i><u>Лабораторні роботи 9 - 10</u></i></magenta>
<b>Виконав:</b> <i>Чорноус Сергій ІПЗ-22</i>
<cyan>Обрати дію

    9 - Лабораторна робота 9. Лінійний пошук
    <i>--- Мета роботи: Навчитися здійснювати пошук елементів у масивах даних,
    використовуючи алгоритм лінійного пошуку</i>

    10 - Лабораторна робота 10. Двійковий пошук
    <i>--- Мета роботи: Навчитися здійснювати пошук елементів у масивах даних,
    використовуючи алгоритм двійкового пошуку</i>

    1 - "Бонус": Стрибковий пошук
    <i>--- Мета роботи: Навчитися здійснювати пошук елементів у масивах даних,
    використовуючи алгоритм стрибкового пошуку</i>

    2 - Тестування алгоритмів пошуку
    <i>--- Порівняння ефективності різних алгоритмів пошуку</i>
    
    ---------------------------------------------------------
    0. Вихід
    
<green>Ваш вибір:
>> </green>)");
        cin >> choice;

        switch (choice)
        {
        case 1:
        case 9:
        case 10:
            RunSearch(choice);
            break;
        case 2:
        {
            int difficulty;
            Log("=== ВИБІР СКЛАДНОСТІ ТЕСТУ ===");
            Log("1 - Легкий (10 елементів в масиві)");
            Log("2 - Середній (100 елементів в масиві)");
            Log("3 - Складний (1000 елементів в масиві)");
            Log("4 - Дуже складний (10000 елементів в масиві)");
            cin >> difficulty;

            switch (difficulty)
            {
            case 1:
                RunTest2(10);
                break;
            case 2:
                RunTest2(100);
                break;
            case 3:
                RunTest2(1000);
                break;
            case 4:
                RunTest2(10000);
                break;
            case 5:
                RunTest2(100000);
                break;
            default:
                LogError("Невірний вибір!");
            } break;
        }

        case 0:
            run = false;
            Log("Повернення");
            break;
        default:
            LogError("Невірний вибір!");
        }
    }

    return 0;
}