/* =======================================================

    Алгоритми і структура данних
    Лабораторна робота №9-10
    Виконав: Чорноус Сергій ІПЗ-22

 ======================================================= */

void RunSearch(short i) {
    bool visualize;
    Log("<cyan>Візуалізувати? 1 - так, 0 - ні\n>> </cyan>");
    cin >> visualize;
    
    if (visualize)
    {
        Log("<cyan>Затримка (мс, рекомендовано 100-1000)\n>> </cyan>");
        cin >> visualizationDelay;
    }
    
    return;
}